Ran Plan for 2 projects:

1. dir: `terraform/03_observability` workspace: `default`
1. dir: `terraform/05_cicd` workspace: `default`

### 1. dir: `terraform/03_observability` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.kube-prometheus.helm_release.helm will be updated in-place
~ resource "helm_release" "helm" {
        id                         = "kube-prometheus-stack"
      ~ metadata                   = [
          - {
              - app_version = "v0.66.0"
              - chart       = "kube-prometheus-stack"
              - name        = "kube-prometheus-stack"
              - namespace   = "kube-prometheus"
              - revision    = 13
              - values      = jsonencode(
                    {
                      - grafana = {
                          - envValueFrom  = {
                              - GF_AUTH_GOOGLE_CLIENT_ID     = {
                                  - secretKeyRef = {
                                      - key  = "client-id"
                                      - name = "gsuite"
                                    }
                                }
                              - GF_AUTH_GOOGLE_CLIENT_SECRET = {
                                  - secretKeyRef = {
                                      - key  = "client-secret"
                                      - name = "gsuite"
                                    }
                                }
                            }
                          - "grafana.ini" = {
                              - auth          = {
                                  - disable_login_form = true
                                }
                              - "auth.google" = {
                                  - allow_sign_up   = true
                                  - allowed_domains = "shutthegoatup.com"
                                  - auth_url        = "https://accounts.google.com/o/oauth2/auth"
                                  - auto_login      = true
                                  - client_id       = "notsecret"
                                  - client_secret   = "notsecret"
                                  - enabled         = true
                                  - hosted_domain   = "shutthegoatup.com"
                                  - scopes          = "https://www.googleapis.com/auth/userinfo.profile https://www.googleapis.com/auth/userinfo.email"
                                  - token_url       = "https://accounts.google.com/o/oauth2/token"
                                  - use_pkce        = true
                                }
                              - server        = {
                                  - root_url = "https://grafana.shutthegoatup.com"
                                }
                            }
                          - ingress       = {
                              - enabled          = true
                              - hosts            = [
                                  - "grafana.shutthegoatup.com",
                                ]
                              - ingressClassName = "nginx"
                              - path             = "/"
                              - pathType         = "Prefix"
                            }
                        }
                    }
                )
              - version     = "47.1.0"
            },
        ] -> (known after apply)
        name                       = "kube-prometheus-stack"
      ~ values                     = [
          - <<-EOT
                ---
                grafana:  
                  ingress:
                    enabled: true
                    ingressClassName: nginx
                    hosts:
                      - grafana.shutthegoatup.com
                    path: /
                    pathType: Prefix
                  grafana.ini:
                    server:
                      root_url: https://grafana.shutthegoatup.com
                    auth:
                      disable_login_form: true
                    auth.google:
                      enabled: true
                      allow_sign_up: true
                      auto_login: true
                      client_id: notsecret
                      client_secret: notsecret
                      scopes: https://www.googleapis.com/auth/userinfo.profile https://www.googleapis.com/auth/userinfo.email
                      auth_url: https://accounts.google.com/o/oauth2/auth
                      token_url: https://accounts.google.com/o/oauth2/token
                      allowed_domains: shutthegoatup.com
                      hosted_domain: shutthegoatup.com
                      use_pkce: true
                  envValueFrom:
                    GF_AUTH_GOOGLE_CLIENT_ID:
                      secretKeyRef:
                        name: gsuite
                        key: client-id
                    GF_AUTH_GOOGLE_CLIENT_SECRET:
                      secretKeyRef:
                        name: gsuite
                        key: client-secret
            EOT,
          + <<-EOT
                ---
                grafana:  
                  ingress:
                    enabled: true
                    ingressClassName: nginx
                    hosts:
                      - grafana.shutthegoatup.com
                    path: /
                    pathType: Prefix
                  grafana.ini:
                    server:
                      root_url: https://grafana.shutthegoatup.com
                    auth:
                      disable_login_form: true
                    auth.google:
                      enabled: true
                      allow_sign_up: true
                      auto_login: true
                      client_id: notsecret
                      client_secret: notsecret
                      scopes: https://www.googleapis.com/auth/userinfo.profile https://www.googleapis.com/auth/userinfo.email
                      auth_url: https://accounts.google.com/o/oauth2/auth
                      token_url: https://accounts.google.com/o/oauth2/token
                      allowed_domains: shutthegoatup.com
                      hosted_domain: shutthegoatup.com
                      use_pkce: true
                  envValueFrom:
                    GF_AUTH_GOOGLE_CLIENT_ID:
                      secretKeyRef:
                        name: gsuite
                        key: client-id
                    GF_AUTH_GOOGLE_CLIENT_SECRET:
                      secretKeyRef:
                        name: gsuite
                        key: client-secret
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/03_observability`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.shutthegoatup.com/lock?id=shutthegoatup%252Fhomelab%252Fterraform%252F03_observability%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/03_observability`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. dir: `terraform/05_cicd` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner-controller.helm_release.gha-runner-scale-set-controller will be updated in-place
~ resource "helm_release" "gha-runner-scale-set-controller" {
        id                         = "arc"
      ~ metadata                   = [
          - {
              - app_version = "0.4.0"
              - chart       = "gha-rs-controller"
              - name        = "arc"
              - namespace   = "actions-runner-controller"
              - revision    = 2
              - values      = jsonencode(
                    {
                      - serviceAccount = {
                          - create = true
                          - name   = "gha"
                        }
                      - template       = {
                          - spec = {
                              - serviceAccountName = "yolo"
                            }
                        }
                    }
                )
              - version     = "0.4.0"
            },
        ] -> (known after apply)
        name                       = "arc"
      ~ values                     = [
          - <<-EOT
                ---
                serviceAccount:
                  create: true
                  name: gha
                
                template:
                  spec:
                    serviceAccountName: yolo
            EOT,
          + <<-EOT
                ---
                serviceAccount:
                  create: true
                  name: gha
                
                template:
                  spec:
                    serviceAccountName: yolo
                    containers:
                      env: 
                      - name: KUBE_IN_CLUSTER_CONFIG
                        value: true
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.atlantis.data.vault_kv_secret_v2.github will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_kv_secret_v2" "github" {
      + created_time    = (known after apply)
      + custom_metadata = (known after apply)
      + data            = (sensitive value)
      + data_json       = (sensitive value)
      + deletion_time   = (known after apply)
      + destroyed       = (known after apply)
      + id              = (known after apply)
      + mount           = "kvv2"
      + name            = "atlantis-github-app"
      + path            = (known after apply)
    }

  # module.atlantis.helm_release.helm will be updated in-place
~ resource "helm_release" "helm" {
        id                         = "atlantis"
      ~ metadata                   = [
          - {
              - app_version = "v0.24.3"
              - chart       = "atlantis"
              - name        = "atlantis"
              - namespace   = "atlantis"
              - revision    = 2
              - values      = jsonencode(
                    {
                      - defaultTFVersion        = "1.4.6"
                      - enableKubernetesBackend = true
                      - environment             = {
                          - KUBE_IN_CLUSTER_CONFIG = true
                        }
                      - githubApp               = {
                          - id     = 56481
                          - key    = <<-EOT
                                -----BEGIN RSA PRIVATE KEY-----
                                MIIEpQIBAAKCAQEArpayFwL0Sn5piV0TYfBo0VKyXtsAcYor2dIyqVyTS9rBPudh
                                WWUhlq60WKr6UJ5a/VrTtayvsuiAAip0RAEz8hgnlFR0v/DYFheKpsshm7SQl0e8
                                7ZNgk51lIX4Z9Ig7v7FJZkM26rM0j4+SrVhkL6WviIvx1WmtDHyJZEJB6WPWPwg2
                                8mZXZbgh5hjZru9v6zCzb/tyaamW1j2yGLVjlsAdzhF1QwiISUYV2T2tqze0p2vA
                                Iw7s79IVJVNyQOeuspBboq3mV/08h8OxJMEKBws7qitShNzEn8jCm2dFHIRdwYdH
                                HsA7ndGiddyuVbjSL1wAaPlDJqdeYIMK0/Uv4QIDAQABAoIBAQCpk+XXRB9UXATW
                                T3mMH58v8ksep0l+/t4o7GoY5rqLaydYmhWMZxaA7aBun2QS+j0W6SnJxLnD5OCx
                                OdtEUobKF3waLw5XgO/iRWt/Jr62JmRrDFsNx6B+wNqB9aHwSoL+Zo0MryygOwBK
                                kQG/LaPiQ+SDlKqIx+Q1xKEOqOysa5lo7dIFIexcwL150nzUaq2ML5Cugybzbr9R
                                Tv5YoFObLj4+3cALc/qCx7Z8s+gvAsdi5G4Na8NHyOCni8QAyT1XpOV5mmyVwYl4
                                DWl5geNQ0fcU0KHIP96LslcRekSumS5NVy393Hc2X1cXm0TpPbJycEAW9eLnUqaQ
                                j/nWtwEhAoGBAN6YGgkFo9RenPbyk4jlrR2gKkg/ANauG2vnu2XsuxVyiadyzo8T
                                MjD08MGVUOgVQfL7AGbfKO1f0NBTqsEskMr3uv/PSi/bDsIhHaVvUU+o6/CKQ7l1
                                46B5Pjgh6Wfn8kFp0fOFnf5Mt03yHzTaEqU1YVbb8ec0UELSZZHj2+tDAoGBAMjK
                                QmVxhYnB2XYxhKU2XAUM6SdpIzBH3ukjR4TcrUQnW7Z9H5PiOFDeHvvmlONNRPkF
                                M4ZdPk9mxlOFMsN/CTMQkLaXc6VOk/JV06DuXnbC7lOfiS0M6FHSX4v4qnaR+jPd
                                8aMsedN02lDymTrKwHpyxxQ1E3sZ7DzXWLms0lwLAoGAU9QCUg1+slbjVBjsuOyO
                                Mo8D/WtEvJSbHRsLNwpdNmmJL7eL1NQM3eUQ2kaKTqzaxlACybsXJbYk5J/tuYw4
                                B0gec4I0VStxNmjUSl5Ox+o82LypXqnoDKI8bVVQGmJ+mGXqvIRAiOmJSuB5IiVS
                                Skd9HgH86u6Hn3Ku769ZPhMCgYEAnaocatWyOxKpdGK7upMtvJV/uv+WrwGwarbW
                                IOC7eSnCnVAw7ImVGQLhp4FO5hE1mKhZ5ibvl5+nGcwcqV/mVF+skoPoPiSujXqR
                                W+vw5yZ3x9gc+fAJuL4NYraW+9XydqnPZQa2frFiAHAOnBi6/SuFYTuwGViopLmg
                                JOQspjMCgYEAv6eraXkTWbv8gm57x17Jr1K7A0TriVZ/XfHIFpmAg/5qKjKuVSLE
                                E3y/YPGAAyJtqEvdhm7PWB7SLhyJ7Eok8HTnQygvAzV9OYwTHnLatIFyyj+Hy0sk
                                0ajLsBFYddm4ZYprzR8fwTChss0YRLAzCJUHjBOJ3wulK6teU7p1uqI=
                                -----END RSA PRIVATE KEY-----
                            EOT
                          - secret = "a2f60b760d0570ee23910fba3f44889a4f401cf0"
                          - slug   = "stgu-autobot"
                        }
                      - hidePrevPlanComments    = true
                      - ingress                 = {
                          - enabled          = true
                          - host             = "atlantis.shutthegoatup.com"
                          - ingressClassName = "nginx"
                          - path             = "/"
                          - pathType         = "Prefix"
                        }
                      - orgAllowlist            = "github.com/shutthegoatup/*"
                      - service                 = {
                          - type = "ClusterIP"
                        }
                    }
                )
              - version     = "4.13.1"
            },
        ] -> (known after apply)
        name                       = "atlantis"
      ~ values                     = [
          - (sensitive value),
        ] -> (known after apply)
        # (26 unchanged attributes hidden)
    }

  # module.vault-config.vault_jwt_auth_backend.oidc will be updated in-place
~ resource "vault_jwt_auth_backend" "oidc" {
        id                     = "oidc"
      ~ provider_config        = {
          + "fetch_groups"             = "true"
          + "fetch_user_info"          = "true"
          + "groups_recurse_max_depth" = "5"
          + "gsuite_admin_impersonate" = "allan@shutthegoatup.com"
          + "gsuite_service_account"   = (sensitive value)
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vault-secrets-operator.data.kubernetes_config_map_v1.ca will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_config_map_v1" "ca" {
      + binary_data = (known after apply)
      + data        = (known after apply)
      + id          = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kube-root-ca.crt"
          + namespace        = "kube-public"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.vault-secrets-operator.vault_kubernetes_auth_backend_config.kubernetes will be updated in-place
~ resource "vault_kubernetes_auth_backend_config" "kubernetes" {
        id                     = "auth/kubernetes/config"
      ~ kubernetes_ca_cert     = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIC/jCCAeagAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
            cm5ldGVzMB4XDTIzMDYzMDEyMzcyOVoXDTMzMDYyNzEyMzcyOVowFTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAMEa
            Sbdtu5oSSGUFzCbUjsoZwe72ip+DCy3GAwXD/3idfHusnv9pE3uqxXYX0l5BuXtx
            1/Xm3zzwne7XSlJWaubrKHrzIi8p1smhuPffK47f0lyYwABhX63vCFy7jC2qm/5t
            Xr4TYIdJe45G7qm0yFjaG5hWC9uAwBd2EmGGUEP57PErdMeQ/XUePGOQ242GzQTY
            84fECl6MsKPvZIgOhv1bVtv4U0a52dvPGPQ+6qwG+JEs+HrCIGS2EjhIxP/XJDA+
            l4n7O4QkTC1ueHkOhwyFeSAeN38S52EuecZ559EqvTjDYnidY5RrDmDDLTHuZGYM
            D1lvMXYfLN/l3SI7Uh8CAwEAAaNZMFcwDgYDVR0PAQH/BAQDAgKkMA8GA1UdEwEB
            /wQFMAMBAf8wHQYDVR0OBBYEFNwzaeSUHjNU9+hMb4t6isHewFMeMBUGA1UdEQQO
            MAyCCmt1YmVybmV0ZXMwDQYJKoZIhvcNAQELBQADggEBACabo/l5uGLxcR8B8Z+e
            rSQzMFBGdeUMbjUsmw2Vda4XCjioK4L7tIJXPeN5+wV1YjKPL3r044Gz7xWBS0Qg
            6uwsTnOZIEx68fkfhcwWCkodVCIkyaqBBJhaHKg3rIZUFupqKYtR2eHiWiBJM+RS
            WNUZeEbY2LIpftoxrH6hg7DXUWz/xOrOxMCx6XYyYjpHxg65GndD9zdJ3q1va/A6
            pMtdg6vGKcKIg4ZXZd01qQeTx3RMVfZn+uKnTZ+SCjacXXnDIfC49oBBRiSdMheR
            cITfl/iqwHTRRMq394Lifw99/QfTAcoeIBWXSsoSaDrop65+b9/+53EVm62+Yssw
            8Vc=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/05_cicd`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.shutthegoatup.com/lock?id=shutthegoatup%252Fhomelab%252Fterraform%252F05_cicd%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/05_cicd`
</details>
Plan: 0 to add, 4 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`